RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/mcal-gen/SysconfigGeneratedDpl/GIP_HMI/AM62Px.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Px" --package "AMH" --part "Default" --context "mcu-r5fss0-0" --product "MCU_PLUS_SDK_AM62Px@10.00.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const epwm        = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1       = epwm.addInstance();
const gpio        = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1       = gpio.addInstance();
const gpio2       = gpio.addInstance();
const gpio3       = gpio.addInstance();
const gpio4       = gpio.addInstance();
const gpio5       = gpio.addInstance();
const gpio6       = gpio.addInstance();
const gpio7       = gpio.addInstance();
const gpio8       = gpio.addInstance();
const gpio9       = gpio.addInstance();
const gpio10      = gpio.addInstance();
const gpio11      = gpio.addInstance();
const gpio12      = gpio.addInstance();
const gpio13      = gpio.addInstance();
const gpio14      = gpio.addInstance();
const gpio15      = gpio.addInstance();
const gpio16      = gpio.addInstance();
const gpio17      = gpio.addInstance();
const gpio18      = gpio.addInstance();
const gpio19      = gpio.addInstance();
const gpio20      = gpio.addInstance();
const gpio21      = gpio.addInstance();
const gpio22      = gpio.addInstance();
const gpio23      = gpio.addInstance();
const gpio24      = gpio.addInstance();
const gpio25      = gpio.addInstance();
const gpio26      = gpio.addInstance();
const gpio27      = gpio.addInstance();
const gpio28      = gpio.addInstance();
const gpio29      = gpio.addInstance();
const gpio30      = gpio.addInstance();
const gpio31      = gpio.addInstance();
const gpio32      = gpio.addInstance();
const gpio33      = gpio.addInstance();
const gpio34      = gpio.addInstance();
const gpio35      = gpio.addInstance();
const gpio36      = gpio.addInstance();
const gpio37      = gpio.addInstance();
const gpio38      = gpio.addInstance();
const gpio39      = gpio.addInstance();
const gpio40      = gpio.addInstance();
const gpio41      = gpio.addInstance();
const gpio42      = gpio.addInstance();
const gpio43      = gpio.addInstance();
const gpio44      = gpio.addInstance();
const gpio45      = gpio.addInstance();
const gpio46      = gpio.addInstance();
const gpio47      = gpio.addInstance();
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const i2c2        = i2c.addInstance();
const i2c3        = i2c.addInstance();
const i2c4        = i2c.addInstance();
const mcspi       = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1      = mcspi.addInstance();
const mcspi2      = mcspi.addInstance();
const mcspi3      = mcspi.addInstance();
const uart        = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1       = uart.addInstance();
const uart2       = uart.addInstance();
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const mpu_armv78  = mpu_armv7.addInstance();
const mpu_armv79  = mpu_armv7.addInstance();
const mpu_armv710 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
epwm1.$name            = "DO_PWM_DIMMING";
epwm1.EPWM.$assign     = "EHRPWM1";
epwm1.EPWM.A.$assign   = "MCASP0_AXR1";
epwm1.EPWM.B.$used     = false;
epwm1.EPWM.SYNCO.$used = false;
epwm1.EPWM.SYNCI.rx    = false;
epwm1.EPWM.SYNCI.$used = false;

gpio1.useMcuDomainPeripherals = false;
gpio1.$name                   = "DI_FALD_PG";
gpio1.GPIO.$assign            = "GPIO0";
gpio1.GPIO.gpioPin.$assign    = "GPMC0_DIR";

gpio2.pinDir                  = "OUTPUT";
gpio2.useMcuDomainPeripherals = false;
gpio2.$name                   = "DO_SOC_PWR_LATCH";
gpio2.GPIO.gpioPin.$assign    = "RGMII2_RD2";

gpio3.$name                   = "TEST_GPIO2";
gpio3.useMcuDomainPeripherals = false;
gpio3.pinDir                  = "OUTPUT";
gpio3.GPIO.gpioPin.$assign    = "RGMII2_RD3";

gpio4.$name                    = "DO_3V3_DISP";
gpio4.pinDir                   = "OUTPUT";
gpio4.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio4.MCU_GPIO.gpioPin.rx      = false;
gpio4.MCU_GPIO.gpioPin.$assign = "PMIC_LPM_EN0";

gpio5.pinDir                  = "OUTPUT";
gpio5.$name                   = "DO_MD_TOUCH_RST";
gpio5.useMcuDomainPeripherals = false;
gpio5.GPIO.$assign            = "GPIO0";
gpio5.GPIO.gpioPin.rx         = false;
gpio5.GPIO.gpioPin.$assign    = "GPMC0_CSn0";

gpio6.$name                    = "DO_EN_5V";
gpio6.pinDir                   = "OUTPUT";
gpio6.MCU_GPIO.gpioPin.rx      = false;
gpio6.MCU_GPIO.gpioPin.$assign = "MCU_UART0_CTSn";

gpio7.$name                    = "DO_LIN_NSLP";
gpio7.pinDir                   = "OUTPUT";
gpio7.MCU_GPIO.gpioPin.rx      = false;
gpio7.MCU_GPIO.gpioPin.$assign = "WKUP_UART0_RTSn";

gpio8.$name                   = "DO_RTC_INTN";
gpio8.pinDir                  = "OUTPUT";
gpio8.useMcuDomainPeripherals = false;
gpio8.GPIO.gpioPin.rx         = false;
gpio8.GPIO.gpioPin.$assign    = "MMC2_SDCD";

gpio9.$name                   = "LED_LATCH";
gpio9.pinDir                  = "OUTPUT";
gpio9.useMcuDomainPeripherals = false;
gpio9.GPIO.$assign            = "GPIO0";
gpio9.GPIO.gpioPin.$assign    = "VOUT0_DATA11";

gpio10.$name                   = "LED_BLANK";
gpio10.useMcuDomainPeripherals = false;
gpio10.GPIO.$assign            = "GPIO0";
gpio10.GPIO.gpioPin.$assign    = "VOUT0_DATA10";

gpio11.$name                   = "LED_GCLK";
gpio11.pinDir                  = "OUTPUT";
gpio11.useMcuDomainPeripherals = false;
gpio11.GPIO.$assign            = "GPIO0";
gpio11.GPIO.gpioPin.$assign    = "VOUT0_DATA12";

gpio12.$name                   = "LED_ERR";
gpio12.useMcuDomainPeripherals = false;
gpio12.GPIO.$assign            = "GPIO0";
gpio12.GPIO.gpioPin.$assign    = "VOUT0_DATA13";

