RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/mcal-gen/SysconfigGeneratedDpl/GIP_HMI/AM62Px.syscfg
gpio13.$name                    = "PIN_WKUP_UART0_CTSN";
gpio13.pinDir                   = "OUTPUT";
gpio13.MCU_GPIO.gpioPin.rx      = false;
gpio13.MCU_GPIO.gpioPin.pu_pd   = "pu";
gpio13.MCU_GPIO.gpioPin.$assign = "WKUP_UART0_CTSn";

gpio14.$name                   = "DI_SBATT2_ERR";
gpio14.useMcuDomainPeripherals = false;
gpio14.GPIO.$assign            = "GPIO0";
gpio14.GPIO.gpioPin.$assign    = "GPMC0_ADVn_ALE";

gpio15.$name                   = "DI_MD_TOUCH_INTN";
gpio15.useMcuDomainPeripherals = false;
gpio15.GPIO.$assign            = "GPIO0";
gpio15.GPIO.gpioPin.$assign    = "GPMC0_CSn1";

gpio16.$name                   = "DI_BL_FAULT";
gpio16.useMcuDomainPeripherals = false;
gpio16.GPIO.$assign            = "GPIO0";
gpio16.GPIO.gpioPin.$assign    = "VOUT0_DATA8";

gpio17.$name                   = "DI_SOC_FPDLINK3_LOCK";
gpio17.useMcuDomainPeripherals = false;
gpio17.GPIO.$assign            = "GPIO0";
gpio17.GPIO.gpioPin.$assign    = "MMC2_DAT2";

gpio18.$name                   = "DI_SOC_FPDLINK3_PASS";
gpio18.useMcuDomainPeripherals = false;
gpio18.GPIO.$assign            = "GPIO0";
gpio18.GPIO.gpioPin.$assign    = "MMC2_CLK";

gpio19.$name                   = "DI_ENET_MII_INT";
gpio19.useMcuDomainPeripherals = false;
gpio19.GPIO.$assign            = "GPIO0";
gpio19.GPIO.gpioPin.$assign    = "RGMII2_TD0";

gpio20.$name                   = "DI_IGN_MON";
gpio20.useMcuDomainPeripherals = false;
gpio20.GPIO.$assign            = "GPIO0";
gpio20.GPIO.gpioPin.$assign    = "RGMII2_TD1";

gpio21.$name                   = "DI_CABLE_DETECT";
gpio21.useMcuDomainPeripherals = false;
gpio21.GPIO.$assign            = "GPIO1";
gpio21.GPIO.gpioPin.$assign    = "RGMII2_RX_CTL";

gpio22.$name                   = "DI_TCON_IND_OUT";
gpio22.useMcuDomainPeripherals = false;
gpio22.GPIO.$assign            = "GPIO1";
gpio22.GPIO.gpioPin.$assign    = "MCASP0_ACLKX";

gpio23.$name                   = "DI_MCU_FALD_CONN_CHK";
gpio23.useMcuDomainPeripherals = false;
gpio23.GPIO.$assign            = "GPIO1";
gpio23.GPIO.gpioPin.$assign    = "RGMII2_RD0";

gpio24.$name                   = "DI_LDO_1V2_FAULTN";
gpio24.useMcuDomainPeripherals = false;
gpio24.GPIO.$assign            = "GPIO1";
gpio24.GPIO.gpioPin.$assign    = "RGMII2_RD1";

gpio25.$name                   = "DI_TFT_ER_DET";
gpio25.useMcuDomainPeripherals = false;
gpio25.GPIO.$assign            = "GPIO1";
gpio25.GPIO.gpioPin.$assign    = "MMC1_SDCD";

gpio26.$name                    = "DO_MCU_RESETSTAZ";
gpio26.pinDir                   = "OUTPUT";
gpio26.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio26.MCU_GPIO.gpioPin.$assign = "MCU_RESETSTATz";

gpio27.$name                   = "DO_VPP_EN";
gpio27.pinDir                  = "OUTPUT";
gpio27.useMcuDomainPeripherals = false;
gpio27.GPIO.$assign            = "GPIO0";
gpio27.GPIO.gpioPin.rx         = false;
gpio27.GPIO.gpioPin.$assign    = "VOUT0_DATA2";

gpio28.$name                   = "DO_MD_GNSS_BOOT_EN";
gpio28.pinDir                  = "OUTPUT";
gpio28.useMcuDomainPeripherals = false;
gpio28.GPIO.$assign            = "GPIO0";
gpio28.GPIO.gpioPin.rx         = false;
gpio28.GPIO.gpioPin.$assign    = "VOUT0_DATA3";

gpio29.$name                   = "DO_MD_GNSS_RESETP";
gpio29.pinDir                  = "OUTPUT";
gpio29.useMcuDomainPeripherals = false;
gpio29.GPIO.$assign            = "GPIO0";
gpio29.GPIO.gpioPin.rx         = false;
gpio29.GPIO.gpioPin.$assign    = "VOUT0_DATA5";

gpio30.$name                   = "DO_MD_GNSS_PWR_EN";
gpio30.pinDir                  = "OUTPUT";
gpio30.useMcuDomainPeripherals = false;
gpio30.GPIO.$assign            = "GPIO0";
gpio30.GPIO.gpioPin.rx         = false;
gpio30.GPIO.gpioPin.$assign    = "VOUT0_DATA6";

gpio31.$name                   = "DO_BLU_OPAMP_PWR_EN";
gpio31.pinDir                  = "OUTPUT";
gpio31.useMcuDomainPeripherals = false;
gpio31.GPIO.$assign            = "GPIO0";
gpio31.GPIO.gpioPin.rx         = false;
gpio31.GPIO.gpioPin.$assign    = "VOUT0_DATA9";

gpio32.$name                   = "DO_BLU_DWALED_EN";
gpio32.pinDir                  = "OUTPUT";
gpio32.useMcuDomainPeripherals = false;
gpio32.GPIO.gpioPin.rx         = false;
gpio32.GPIO.gpioPin.$assign    = "VOUT0_DATA15";

gpio33.$name                   = "DO_TCON_BYPASS_MODE";
gpio33.pinDir                  = "OUTPUT";
gpio33.useMcuDomainPeripherals = false;
gpio33.GPIO.$assign            = "GPIO0";
gpio33.GPIO.gpioPin.rx         = false;
gpio33.GPIO.gpioPin.$assign    = "VOUT0_HSYNC";

gpio34.$name                   = "DO_TCON_BYPASS_SEL0";
gpio34.pinDir                  = "OUTPUT";
gpio34.useMcuDomainPeripherals = false;
gpio34.GPIO.$assign            = "GPIO0";
gpio34.GPIO.gpioPin.rx         = false;
gpio34.GPIO.gpioPin.$assign    = "VOUT0_DE";

gpio35.$name                   = "DO_TCON_BYPASS_SEL1";
gpio35.pinDir                  = "OUTPUT";
gpio35.useMcuDomainPeripherals = false;
gpio35.GPIO.$assign            = "GPIO0";
gpio35.GPIO.gpioPin.rx         = false;
gpio35.GPIO.gpioPin.$assign    = "VOUT0_VSYNC";

gpio36.$name                   = "DO_SOC_FPDLINK3_INTB";
gpio36.pinDir                  = "OUTPUT";
gpio36.useMcuDomainPeripherals = false;
gpio36.GPIO.$assign            = "GPIO0";
gpio36.GPIO.gpioPin.rx         = false;
gpio36.GPIO.gpioPin.$assign    = "MMC2_DAT0";

gpio37.$name                   = "DO_SOC_FPDLINK3_BISTEN";
gpio37.pinDir                  = "OUTPUT";
gpio37.useMcuDomainPeripherals = false;
gpio37.GPIO.$assign            = "GPIO0";
gpio37.GPIO.gpioPin.rx         = false;
gpio37.GPIO.gpioPin.$assign    = "MMC2_CMD";

gpio38.pinDir                  = "OUTPUT";
gpio38.useMcuDomainPeripherals = false;
gpio38.$name                   = "DO_EN_BUCK_FALD";
gpio38.GPIO.$assign            = "GPIO1";
gpio38.GPIO.gpioPin.rx         = false;

gpio39.$name                   = "DO_MCU_AMUX_S1";
gpio39.useMcuDomainPeripherals = false;
gpio39.pinDir                  = "OUTPUT";
gpio39.GPIO.$assign            = "GPIO1";
gpio39.GPIO.gpioPin.rx         = false;
gpio39.GPIO.gpioPin.$assign    = "MCASP0_AFSX";

gpio40.$name                   = "DO_MCU_AMUX_S0";
gpio40.pinDir                  = "OUTPUT";
gpio40.useMcuDomainPeripherals = false;
gpio40.GPIO.$assign            = "GPIO1";
gpio40.GPIO.gpioPin.rx         = false;
gpio40.GPIO.gpioPin.$assign    = "MCASP0_AFSR";

gpio41.$name                   = "DO_TCON_SPI0_CS0";
gpio41.pinDir                  = "OUTPUT";
gpio41.useMcuDomainPeripherals = false;
gpio41.GPIO.$assign            = "GPIO1";
gpio41.GPIO.gpioPin.rx         = false;
gpio41.GPIO.gpioPin.$assign    = "SPI0_CS0";

gpio42.$name                   = "DESER_SPI1_DO";
gpio42.pinDir                  = "OUTPUT";
gpio42.useMcuDomainPeripherals = false;
gpio42.GPIO.$assign            = "GPIO1";
gpio42.GPIO.gpioPin.rx         = false;
gpio42.GPIO.gpioPin.$assign    = "MMC1_DAT3";

gpio43.$name                   = "DO_SOC_TCON_GRBN";
gpio43.pinDir                  = "OUTPUT";
gpio43.useMcuDomainPeripherals = false;
gpio43.GPIO.$assign            = "GPIO1";
gpio43.GPIO.gpioPin.rx         = false;
gpio43.GPIO.gpioPin.$assign    = "MMC1_DAT1";

gpio44.$name                   = "DO_TFT_CSB";
gpio44.pinDir                  = "OUTPUT";
gpio44.useMcuDomainPeripherals = false;
gpio44.GPIO.$assign            = "GPIO1";
gpio44.GPIO.gpioPin.rx         = false;
gpio44.GPIO.gpioPin.$assign    = "MMC1_SDWP";

gpio45.$name                    = "DO_TFT_BL_EN";
gpio45.pinDir                   = "OUTPUT";
gpio45.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio45.MCU_GPIO.gpioPin.rx      = false;
gpio45.MCU_GPIO.gpioPin.$assign = "WKUP_CLKOUT0";

gpio46.$name = "PMIC_INT";

