RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/mcal-gen/SysconfigGeneratedDpl/GIP_HMI/AM62Px.syscfg
gpio47.$name                    = "CONFIG_GPIO0";
gpio47.MCU_GPIO.gpioPin.rx      = false;
gpio47.MCU_GPIO.gpioPin.$assign = "WKUP_I2C0_SCL";

i2c1.$name               = "CONFIG_I2C0";
i2c1.bitRate             = "100KHZ";
i2c1.MCU_I2C.$assign     = "MCU_I2C0";
i2c1.MCU_I2C.SCL.$assign = "MCU_I2C0_SCL";
i2c1.MCU_I2C.SDA.$assign = "MCU_I2C0_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

i2c2.$name                   = "CONFIG_I2C1";
i2c2.useMcuDomainPeripherals = false;
i2c2.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template1";
i2c2.I2C.SCL.$assign         = "GPMC0_CSn2";
i2c2.I2C.SDA.$assign         = "GPMC0_CSn3";

i2c3.$name                   = "CONFIG_I2C2";
i2c3.useMcuDomainPeripherals = false;
i2c3.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template2";
i2c3.I2C.$assign             = "I2C3";
i2c3.I2C.SCL.$assign         = "UART0_CTSn";
i2c3.I2C.SDA.$assign         = "UART0_RTSn";

i2c4.$name                   = "CONFIG_I2C3";
i2c4.useMcuDomainPeripherals = false;
i2c4.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template3";
i2c4.I2C.$assign             = "I2C1";
mcspi1.$name                           = "CONFIG_MCSPI0";
mcspi1.mcspiChannel[0].$name           = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].MCU_CSn.$assign = "MCU_SPI0_CS1";

mcspi2.$name                   = "CONFIG_MCSPI1";
mcspi2.useMcuDomainPeripherals = false;
mcspi2.pinMode                 = 3;
mcspi2.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH1";
mcspi2.SPI.$assign             = "SPI2";

mcspi3.$name                       = "CONFIG_MCSPI2";
mcspi3.useMcuDomainPeripherals     = false;
mcspi3.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH2";
mcspi3.mcspiChannel[0].CSn.$assign = "SPI0_CS1";
mcspi3.SPI.$assign                 = "SPI0";
mcspi3.SPI.CLK.$assign             = "SPI0_CLK";
mcspi3.SPI.D0.$assign              = "SPI0_D0";
mcspi3.SPI.D1.$assign              = "SPI0_D1";

uart1.$name                = "CONFIG_UART0";
uart1.MCU_UART.$assign     = "MCU_USART0";
uart1.MCU_UART.RXD.$assign = "MCU_UART0_RXD";
uart1.MCU_UART.TXD.$assign = "MCU_UART0_TXD";

uart2.$name                      = "CONFIG_UART1";
uart2.useMcuDomainPeripherals    = false;
uart2.useWakeupDomainPeripherals = true;
uart2.WKUP_UART.$assign          = "WKUP_USART0";
uart2.WKUP_UART.RXD.$assign      = "WKUP_UART0_RXD";
uart2.WKUP_UART.TXD.$assign      = "WKUP_UART0_TXD";

debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;
debug_log.enableCssLog         = false;

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.allowExecute = false;
mpu_armv71.attributes   = "CUSTOM";
mpu_armv71.isCacheable  = false;
mpu_armv71.isBufferable = false;
mpu_armv71.tex          = 0;

mpu_armv72.$name        = "CONFIG_MPU_REGION1";
mpu_armv72.size         = 7;
mpu_armv72.attributes   = "CUSTOM";
mpu_armv72.isBufferable = false;

mpu_armv73.$name    = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr = 0x79100000;
mpu_armv73.size     = 19;

mpu_armv74.$name    = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr = 0x70000000;
mpu_armv74.size     = 21;

mpu_armv75.$name    = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr = 0x80000000;
mpu_armv75.size     = 31;

mpu_armv76.$name      = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr   = 0x41010000;
mpu_armv76.size       = 15;
mpu_armv76.attributes = "CUSTOM";
mpu_armv76.tex        = 0;

mpu_armv77.$name      = "CONFIG_MPU_REGION6";
mpu_armv77.size       = 15;
mpu_armv77.attributes = "CUSTOM";
mpu_armv77.tex        = 0;

mpu_armv78.$name        = "CONFIG_MPU_REGION7";
mpu_armv78.attributes   = "CUSTOM";
mpu_armv78.isCacheable  = false;
mpu_armv78.isBufferable = false;
mpu_armv78.isShareable  = true;
mpu_armv78.tex          = 0;
mpu_armv78.allowExecute = false;
mpu_armv78.baseAddr     = 0x82380000;
mpu_armv78.size         = 19;

mpu_armv79.$name        = "CONFIG_MPU_REGION8";
mpu_armv79.allowExecute = false;
mpu_armv79.attributes   = "CUSTOM";
mpu_armv79.isShareable  = true;
mpu_armv79.isCacheable  = false;
mpu_armv79.isBufferable = false;
mpu_armv79.tex          = 0;
mpu_armv79.baseAddr     = 0x82400000;
mpu_armv79.size         = 21;

mpu_armv710.$name        = "CONFIG_MPU_REGION9";
mpu_armv710.baseAddr     = 0x82B00000;
mpu_armv710.size         = 20;
mpu_armv710.attributes   = "CUSTOM";
mpu_armv710.isCacheable  = false;
mpu_armv710.isBufferable = false;
mpu_armv710.isShareable  = true;
mpu_armv710.allowExecute = false;
mpu_armv710.tex          = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio2.GPIO.$suggestSolution              = "GPIO1";
gpio3.GPIO.$suggestSolution              = "GPIO1";
gpio6.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio7.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio8.GPIO.$suggestSolution              = "GPIO0";
gpio13.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio32.GPIO.$suggestSolution             = "GPIO0";
gpio38.GPIO.gpioPin.$suggestSolution     = "RGMII2_TD3";
gpio46.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio46.MCU_GPIO.gpioPin.$suggestSolution = "MCU_SPI0_CS0";
gpio47.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
i2c2.I2C.$suggestSolution                = "I2C2";
i2c4.I2C.SCL.$suggestSolution            = "I2C1_SCL";
i2c4.I2C.SDA.$suggestSolution            = "I2C1_SDA";
mcspi1.MCU_SPI.$suggestSolution          = "MCU_SPI0";
mcspi1.MCU_SPI.CLK.$suggestSolution      = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$suggestSolution       = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$suggestSolution       = "MCU_SPI0_D1";
mcspi2.SPI.CLK.$suggestSolution          = "MCASP0_ACLKR";
mcspi2.SPI.D0.$suggestSolution           = "MCASP0_AXR3";
mcspi2.SPI.D1.$suggestSolution           = "MCASP0_AXR2";
